wintersmith/contents/articles/linux/2013-03-30-emacs-org-misc.html
---
date: 2013-03-30
template: tech.jade
title: emacs org-mode 使用杂记
category: Linux
tag: emacs,org-mode
change_frequency: monthly
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">导出project配置</a></li>
<li><a href="#sec-2">使用org-bable 插入Source Code</a></li>
<li><a href="#sec-3">导出语法高亮的Source Code</a></li>
<li><a href="#sec-4">导出时不执行代码</a></li>
<li><a href="#sec-5">导出代码和代码执行结果</a></li>
<li><a href="#sec-6">org-mode specific header arguments</a></li>
<li><a href="#sec-7">有趣的org-bable语言</a></li>
<li><a href="#sec-8">输入换行(line break)</a></li>
<li><a href="#sec-9">输入整个段落，保持输入的格式</a></li>
<li><a href="#sec-10">输入引用(quoting)</a></li>
<li><a href="#sec-11">居中</a></li>
<li><a href="#sec-12">Emacs Cool Site</a></li>
</ul>
</div>
</div>
<p>
Emacs org-mode 用来写blog,然后export 出HTML,最后再使用jekyll生成静态blog,发布在github上.
</p>

<p>
这是我写blog的方法,刚刚接触emacs org-mode,所以遇到了不少初级麻烦,折腾之后,记录在这里,
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">导出project配置</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; load org
(require 'org)
;; load htmlize.el , which org-babel export syntax highlight source code need it
(require 'htmlize)
;; org-mode project define
(setq org-publish-project-alist
      '(
	("org-blog-content" ;; 博客内容
	 ;; Path to your org files.
	 :base-directory "~/ChinaXing.org/org/"
	 :base-extension "org"
	 ;; Path to your jekyll project.
	 :publishing-directory "~/ChinaXing.org/jekyll/"
	 :recursive t
	 :publishing-function org-publish-org-to-html
	 :headline-levels 4
	 :html-extension "html"
	 :table-of-contents t ;; 导出目录
	 :body-only t ;; Only export section between &lt;body&gt;&lt;/body&gt;
	 )
	("org-blog-static" ;; 静态文件
	 :base-directory "~/ChinaXing.org/org/"
	 :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|php\\|svg"
	 :publishing-directory "~/ChinaXing.org/jekyll/"
	 :recursive t
	 :publishing-function org-publish-attachment)
	("blog" :components ("org-blog-content" "org-blog-static"))
	))
(setq org-src-fontify-natively t)
;; active Babel languages
(org-babel-do-load-languages
 'org-babel-load-languages
 '((C . t)
   (emacs-lisp . t)
   (sh . t)
   (perl . t)
   (python .t)
   ))
</pre>
</div>

<p>
org-mode 是emacs默认自带的,不需要另外安装
</p>

<p>
org-mode 依赖htmlize来导出代码高亮的html,所以需要下载这个package.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">使用org-bable 插入Source Code</h2>
<div class="outline-text-2" id="text-2">
<p>
org-babel 是org-mode 的一部分,用来管理org文档中的源码,org-babel支持多种<a href="http://orgmode.org/worg/org-contrib/babel/languages.html">语言</a>.
</p>

<p>
org-babel 默认只会加载emacs-lisp这种语言,如果我们要插入org文档中别的语言,需要在.emacs配置文件中指明要加载的语言.
</p>

<p>
如,我的配置文件中指明要加载C, perl, python
</p>

<p>
org-babel 可以在org文档中插入代码,并且会帮你语法高亮插入的代码,而且可以执行你插入的代码,捕获输出,插入到你代码的下面.
</p>
<pre class="example">
#+begin_src sh :exports both :results output :eval no-export
  figlet 'china xing !'    
#+end_src

#+RESULTS:
:       _     _                    _               _ 
:   ___| |__ (_)_ __   __ _  __  _(_)_ __   __ _  | |
:  / __| '_ \| | '_ \ / _` | \ \/ / | '_ \ / _` | | |
: | (__| | | | | | | | (_| |  &gt;  &lt;| | | | | (_| | |_|
:  \___|_| |_|_|_| |_|\__,_| /_/\_\_|_| |_|\__, | (_)
:                                          |___/
</pre>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">导出语法高亮的Source Code</h2>
<div class="outline-text-2" id="text-3">
<p>
将org文档导出成html文档,要使导出的html文档中源代码部分保持语法高亮,需要如下设置:
</p>
<ol class="org-ol">
<li>设置 org-src-fontify-natively 为 t 
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-src-fontify-natively t)
</pre>
</div>
</li>
<li>安装htmlize.el 这个package. org使用其进行颜色转换.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">导出时不执行代码</h2>
<div class="outline-text-2" id="text-4">
<p>
如果你嵌入的是shell代码,且希望导出执行结果,在你执行导出的时候,emacs 会提问你是否在本机上执行嵌入的代码,这样每次你导出的时候都会进行提问,比较麻烦,
我们可以通过设置选项eval来解决:
</p>
<pre class="example">
#+begin_src sh :exports both :results output :eval no-export
  figlet 'china xing !'    
#+end_src
...
</pre>

<p>
<b>no-export</b> 告诉org,在执行导出的时候不要对代码块进行执行和求值.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">导出代码和代码执行结果</h2>
<div class="outline-text-2" id="text-5">
<p>
在导出的时候,org默认只会导出code,执行结果不会导出
</p>

<ol class="org-ol">
<li>如果希望导出执行结果,使用:exports result
</li>
<li>如果希望导出代码和执行结果,使用:exports both
</li>
<li>如果不希望导出代码和执行结果,使用:exports none
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">org-mode specific header arguments</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="http://orgmode.org/manual/Specific-header-arguments.html">特殊参数</a> 控制导出、代码块执行、执行结果的类型、输出格式等
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">有趣的org-bable语言</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>R 语言
该语言可以方便的将数据转换为<a href="http://orgmode.org/worg/org-contrib/babel/intro.html#source-code-blocks-babel">饼状图</a>。
</li>
<li>Ditaa 语言
该语言的作用是将ASCII画的图转换为bitmap格式的图片，转换后的<a href="http://orgmode.org/worg/org-contrib/babel/languages/ob-doc-ditaa.html">效果</a>非常好看。 <a href="http://emacs-fu.blogspot.com/2009/01/drawing-pictures.html">See</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">输入换行(line break)</h2>
<div class="outline-text-2" id="text-8">
<p>
在行尾，输入"\\"
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">输入整个段落，保持输入的格式</h2>
<div class="outline-text-2" id="text-9">
<p class="verse">
Greate clouds overhead<br  />
Tiny black birds rise and fall<br  />
Snow covers Emacs<br  />
<br  />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#x2013; AlexSchroeder<br  />
</p>
<pre class="example">
#+BEGIN_VERSE
  Greate clouds overhead
  Tiny black birds rise and fall
  Snow covers Emacs

         -- AlexSchroeder
#+END_VERSE
</pre>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">输入引用(quoting)</h2>
<div class="outline-text-2" id="text-10">
<blockquote>
<p>
Greate clouds overhead
Tiny black birds rise and fall
Snow covers Emacs
</p>

<p>
&#x2013; AlexSchroeder
</p>
</blockquote>
<pre class="example">
#+BEGIN_QUOTE
  Greate clouds overhead
  Tiny black birds rise and fall
  Snow covers Emacs

         -- AlexSchroeder
#+END_QUOTE
</pre>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">居中</h2>
<div class="outline-text-2" id="text-11">
<div class="center">
<p>
Greate clouds overhead
Tiny black birds rise and fall
Snow covers Emacs
</p>

<p>
&#x2013; AlexSchroeder
</p>
</div>
<pre class="example">
#+BEGIN_CENTER
  Greate clouds overhead
  Tiny black birds rise and fall
  Snow covers Emacs

         -- AlexSchroeder
#+END_CENTER
</pre>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Emacs Cool Site</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>USEFUL TRICKS FOR EMACS : <a href="http://emacs-fu.blogspot.com/">emacs-fu</a>
</li>
<li>Mastering Emacs :  <a href="http://www.masteringemacs.org/">mastering emacs</a>
</li>
</ul>
</div>
</div>
